# Напишите программу, которая получает целое число
# и возвращает его шестнадцатеричное строковое представление.
# Функцию hex используйте для проверки своего результата.

number = int(input('Введите целое число: '))
print(number, 'in hex =', hex(number))
